tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "railwaycat/emacsmacport"
tap "vitorgalvao/tiny-scripts"
# Search tool like grep, but optimized for programmers
brew "ack"
# Optimized BLAS library
brew "openblas"
# Spell checker with better logic than ispell
brew "aspell"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Collection of portable C++ source libraries
brew "boost"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Object-file caching compiler wrapper
brew "ccache"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# JBIG2 decoder and library (for monochrome documents)
brew "jbig2dec"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line utility for uploading Gists
brew "gist"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Framework for layout and rendering of i18n text
brew "pango"
# GNU grep, egrep and fgrep
brew "grep"
# Improved top (interactive process viewer)
brew "htop"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Compare and mark up LaTeX file differences
brew "latexdiff"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Implementation of the file(1) command
brew "libmagic"
# GUI for vim, made for macOS
brew "macvim"
# Creates dependencies in makefiles
brew "makedepend"
# Mac App Store command-line interface
brew "mas"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Library for creating multi-platform software
brew "s-lang"
# Powerful paging program
brew "most"
# Turn marked-up plain text into well-formatted documents
brew "multimarkdown"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# C/C++ function library for exporting 2-D vector graphics
brew "plotutils"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Convert PostScript and PDF files to editable vector graphics
brew "pstoedit"
# Python version management
brew "pyenv"
# Make Python build faster, using the leverage of `ccache`
brew "pyenv-ccache"
# Migrate pip packages from one Python version to another
brew "pyenv-pip-migrate"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Software environment for statistical computing
brew "r"
# RC file (dotfile) management
brew "rcm"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup-init"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# SMART hard drive monitoring
brew "smartmontools"
# Full-text search engine
brew "sphinx"
# Version control system designed to be a better CVS
brew "svn"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Official documentation format of the GNU project
brew "texinfo"
# Code-search similar to ack
brew "the_silver_searcher"
# Programmatically correct mistyped console commands
brew "thefuck"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Internet file retriever
brew "wget"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Tips, tricks, and examples for zsh
brew "zsh-lovers"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Quickly repair outdated/broken Casks from homebrew-cask
brew "vitorgalvao/tiny-scripts/cask-repair"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Apple TV Aerial screensaver
cask "aerial"
# Molecule editor and visualizer
cask "avogadro"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# App to manage bank accounts in one place
cask "banktivity"
# Utility to create and modify archives
cask "betterzip"
# Edit and manage bibliographies
cask "bibdesk"
# Reference management and bibliography software
cask "bookends"
# Scriptable scratchpad for developers
cask "boop"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Calculator software
cask "chalk"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Free and open-source web browser
cask "chromium"
cask "cocoaspell"
cask "colorpicker-developer"
cask "colorpicker-propicker"
# Tool to help searching the web more efficiently
cask "devonagent"
# Collect, organize, edit and annotate documents
cask "devonthink"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "emacs-mac-spacemacs-icon"
# Calendar software
cask "fantastical"
# Open-source image processing package
cask "fiji"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-inconsolata"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-liberation"
cask "font-open-sans"
# Unicode fonts for scientific, technical, and mathematical texts
cask "font-stix"
# Finder replacement and FTP, SFTP, WebDAV and Amazon s3 client
cask "forklift"
# Open-source video transcoder
cask "handbrake"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Productivity tool
cask "launchbar"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Collection of services for Markdown-formatted text
cask "markdown-service-tools"
cask "meshmixer"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Interactive computing suite
cask "nteract"
# Scheduling application focusing on organization
cask "omnifocus"
# Visual communication software
cask "omnigraffle"
# Note taking applciation and information organizer
cask "omnioutliner"
# Manage all your tasks, files, and notes
cask "pagico"
#PDF editing software
cask "pdfpenpro"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlstephen"
cask "quicklook-csv"
# Collection of apps available by subscription
cask "setapp"
# PDF reader and note-taking application
cask "skim"
# Video game digital distribution service
cask "steam"
# Backup, recovery and cloning software
cask "superduper"
# Graphical user interface for TeX Live Manager
cask "tex-live-utility"
# General-purpose text editor
cask "textmate"
# Open-source BitTorrent client
cask "transmission"
# 3D printer and slicing GUI
cask "ultimaker-cura"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Blocker", id: 1365531024
mas "Acorn", id: 1019272813
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Airmail", id: 918858936
mas "Blogo", id: 902111700
mas "Book Track", id: 1496543317
mas "Calca", id: 635758264
mas "DaisyDisk", id: 411643860
mas "Drafts", id: 1435957248
mas "GarageBand", id: 682658836
mas "HP Easy Scan", id: 967004861
mas "iMovie", id: 408981434
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "Knights of the Old Republic", id: 416608891
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Pocket", id: 568494494
mas "Roofs", id: 1449570266
mas "Slack", id: 803453959
mas "StopTheMadness", id: 1376402589
mas "Twitterrific", id: 1289378661
mas "Xcode", id: 497799835
