tap "beeftornado/rmtree"
tap "cartr/qt4"
tap "elmercsc/elmerfem"
tap "guitorri/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-eid"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "railwaycat/emacsmacport"
tap "thoughtbot/formulae"
tap "timtylin/scholdoc"
tap "vitorgalvao/tiny-scripts"
cask "osxfuse"
brew "ack"
brew "archey"
brew "gmp"
brew "aspell", link: false
brew "autoconf"
brew "automake"
brew "avrdude"
brew "bash"
brew "bat"
brew "bdw-gc"
brew "bison"
brew "blahtexml"
brew "icu4c"
brew "boost-build"
brew "brew-gem"
brew "brew-pip"
brew "ghc"
brew "cabal-install"
brew "gettext"
brew "glib"
brew "emacs", link: false
brew "cask"
brew "ccat"
brew "cmark"
brew "coreutils"
brew "curl"
brew "ddrescue"
brew "diff-so-fancy"
brew "ghostscript"
brew "djvu2pdf"
brew "doxygen"
brew "exiftool"
brew "ext2fuse"
brew "ext4fuse"
brew "gobject-introspection"
brew "harfbuzz"
brew "lame"
brew "openjpeg"
brew "ffmpeg"
brew "fftw"
brew "findutils"
brew "fltk"
brew "fondu"
brew "fping"
brew "gawk"
brew "gdb"
brew "ruby"
brew "gem-kramdown"
brew "gem-liquid"
brew "gem-pygments.rb"
brew "gh"
brew "gist"
brew "git"
brew "glpk"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "go"
brew "graphicsmagick"
brew "gsl"
brew "szip"
brew "hdf5"
brew "hello"
brew "mercurial"
brew "hg-flow"
brew "highlight"
brew "hr"
brew "htop"
brew "imagemagick"
brew "intltool"
brew "itex2mml"
brew "jbig2dec"
brew "jq"
brew "libcroco"
brew "libssh2"
brew "libgit2"
brew "librsvg"
brew "libsigc++"
brew "libsodium"
brew "llvm"
brew "llvm@4"
brew "macvim"
brew "memtester"
brew "metis"
brew "s-lang"
brew "most"
brew "multimarkdown"
brew "muparser"
brew "neovim"
brew "ngrep"
brew "ngspice"
brew "node"
brew "nss"
brew "ntfs-3g"
brew "numpy"
brew "nwchem"
brew "plotutils", link: false
brew "pstoedit"
brew "qhull"
brew "qrupdate"
brew "texinfo"
brew "octave"
brew "pandoc"
brew "pandoc-citeproc"
brew "pandoc-crossref"
brew "pdflib-lite"
brew "poppler"
brew "popt"
brew "prettyping"
brew "py2cairo"
brew "py3cairo"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-which-ext"
brew "r"
brew "ripgrep"
brew "rlwrap"
brew "rust"
brew "scipy"
brew "smake"
brew "smartmontools"
brew "sphinx-doc"
brew "stress"
brew "task"
brew "telnet"
brew "terminal-notifier"
brew "testdisk"
brew "the_silver_searcher"
brew "thefuck"
brew "tldr"
brew "trash"
brew "tree"
brew "unar"
brew "veclibfort"
brew "vtk"
brew "wget"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "guitorri/tap/asco"
brew "railwaycat/emacsmacport/emacs-mac", link: false
brew "thoughtbot/formulae/rcm"
brew "vitorgalvao/tiny-scripts/cask-repair"
cask "0xed"
cask "1password"
cask "adobe-creative-cloud"
cask "avogadro"
cask "balenaetcher"
cask "bartender"
cask "bbedit"
cask "blender"
cask "blockblock"
cask "bookends"
cask "calibre"
cask "chalk"
cask "cocoaspell"
cask "colloquy"
cask "colorpicker-hex"
cask "compositor"
cask "deltawalker"
cask "detexify"
cask "devonagent"
cask "devonthink"
cask "djview"
cask "dropbox"
cask "emacs"
cask "fantastical"
cask "fiji"
cask "firefox"
cask "fluid"
cask "foldingtext"
cask "font-fira-code"
cask "font-gnu-unifont"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-stix"
cask "font-xits"
cask "forklift"
cask "google-chrome"
cask "graphsketcher"
cask "highsierramediakeyenabler"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "julia"
cask "karabiner-elements"
cask "keka"
cask "launchbar"
cask "libreoffice"
cask "logitech-control-center"
cask "logitech-unifying"
cask "ltspice"
cask "lulu"
cask "macdown"
cask "mactex"
cask "markdown-service-tools"
cask "marked"
cask "mathpix-snipping-tool"
cask "meshmixer"
cask "min"
cask "mono-mdk"
cask "netnewswire"
cask "nteract"
cask "omnifocus"
cask "omnigraffle"
cask "omnioutliner"
cask "onedrive"
cask "openscad"
cask "pagico"
cask "parallels"
cask "pdf-expert"
cask "pdfpenpro"
cask "pref-setter"
cask "preform"
cask "prefs-editor"
cask "pycharm-edu"
cask "qlcolorcode"
cask "quicklook-csv"
cask "quicktime-player7"
cask "rstudio"
cask "skim"
cask "skype"
cask "sourcetree"
cask "spotify"
cask "superduper"
cask "textexpander"
cask "textmate"
cask "the-unarchiver"
cask "ttscoff-mmd-quicklook"
cask "ultimaker-cura"
cask "veusz"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "vmware-fusion"
cask "vmware-fusion8"
cask "vmware-horizon-client"
cask "whalebird"
cask "xmind"
cask "xquartz"
cask "zoomus"
